#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
data.azurerm_client_config.current: Reading...
module.keyvault.data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hYmMzY2M3MC0xYjMyLTRiNTAtYmU4Ni00NDhmYTk2YTA3MWU7b2JqZWN0SWQ9YzBjYzhmMjEtMTRjNS00NTkzLWJiYTItMGI4NmUyZmUwNWJiO3N1YnNjcmlwdGlvbklkPTc5YTlhZTU2LWZjYzItNDcxNy1hMTg0LWE0MDlhZGY3ZDY2OTt0ZW5hbnRJZD02M2QwZjA4ZS02NTc5LTRkNTItOWM5NS00YmFlZjY2OTA2ZWE=]
module.keyvault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hYmMzY2M3MC0xYjMyLTRiNTAtYmU4Ni00NDhmYTk2YTA3MWU7b2JqZWN0SWQ9YzBjYzhmMjEtMTRjNS00NTkzLWJiYTItMGI4NmUyZmUwNWJiO3N1YnNjcmlwdGlvbklkPTc5YTlhZTU2LWZjYzItNDcxNy1hMTg0LWE0MDlhZGY3ZDY2OTt0ZW5hbnRJZD02M2QwZjA4ZS02NTc5LTRkNTItOWM5NS00YmFlZjY2OTA2ZWE=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.acr.azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + data_endpoint_host_names      = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westus3"
      + login_server                  = (known after apply)
      + name                          = "acrplatformdevwus3"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = [
          + {
              + default_action = "Allow"
              + ip_rule        = (known after apply)
            },
        ]
      + public_network_access_enabled = true
      + resource_group_name           = "rg-aks-platform-dev-wus3"
      + sku                           = "Basic"
      + tags                          = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_role_assignment.kubelet_acrpull will be created
  + resource "azurerm_role_assignment" "kubelet_acrpull" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_federated_identity_credential.workload will be created
  + resource "azurerm_federated_identity_credential" "workload" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = (known after apply)
      + name                = "fed-id-aks-workload-dev-wus3"
      + parent_id           = (known after apply)
      + resource_group_name = "rg-aks-platform-dev-wus3"
      + subject             = "system:serviceaccount:app-dev:workload-identity-sa"
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + ai_toolchain_operator_enabled       = false
      + automatic_upgrade_channel           = "stable"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "aks-platform-dev"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.30"
      + location                            = "westus3"
      + name                                = "aks-platform-dev-wus3"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "rg-aks-platform-dev-wus3"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + workload_identity_enabled           = true

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = []
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled         = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 3
          + max_pods                     = 30
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = 2
          + node_labels                  = {
              + "nodepool" = "system"
            }
          + only_critical_addons_enabled = true
          + orchestrator_version         = (known after apply)
          + os_disk_size_gb              = 30
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = "Ubuntu"
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "Application" = "aks-platform"
              + "CostCenter"  = "IT-1234"
              + "Environment" = "dev"
              + "ManagedBy"   = "terraform"
              + "Owner"       = "platform-team"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_B2ms"
          + vnet_subnet_id               = (known after apply)
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
              + "2",
              + "3",
            ]

          + upgrade_settings {
              + max_surge = "10%"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + maintenance_window {
          + allowed {
              + day   = "Saturday"
              + hours = [
                  + 2,
                  + 3,
                  + 4,
                  + 5,
                ]
            }
          + allowed {
              + day   = "Sunday"
              + hours = [
                  + 2,
                  + 3,
                  + 4,
                  + 5,
                ]
            }
        }

      + network_profile {
          + dns_service_ip      = "10.245.0.10"
          + ip_versions         = (known after apply)
          + load_balancer_sku   = "standard"
          + network_data_plane  = "azure"
          + network_mode        = (known after apply)
          + network_plugin      = "azure"
          + network_plugin_mode = "overlay"
          + network_policy      = "azure"
          + outbound_type       = "loadBalancer"
          + pod_cidr            = "10.244.0.0/16"
          + pod_cidrs           = (known after apply)
          + service_cidr        = "10.245.0.0/16"
          + service_cidrs       = (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.workload will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "workload" {
      + auto_scaling_enabled  = true
      + eviction_policy       = "Delete"
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 4
      + max_pods              = 30
      + min_count             = 1
      + mode                  = "User"
      + name                  = "workload"
      + node_count            = 2
      + node_labels           = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
          + "nodepool"                              = "workload"
        }
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 30
      + os_disk_type          = "Ephemeral"
      + os_sku                = "Ubuntu"
      + os_type               = "Linux"
      + priority              = "Spot"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_B2ms"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
          + "2",
          + "3",
        ]

      + upgrade_settings {
          + max_surge = "10%"
        }
    }

  # module.aks.azurerm_user_assigned_identity.kubelet will be created
  + resource "azurerm_user_assigned_identity" "kubelet" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westus3"
      + name                = "id-aks-kubelet-dev-wus3"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-aks-platform-dev-wus3"
      + tags                = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + tenant_id           = (known after apply)
    }

  # module.aks.azurerm_user_assigned_identity.workload will be created
  + resource "azurerm_user_assigned_identity" "workload" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westus3"
      + name                = "id-aks-workload-dev-wus3"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-aks-platform-dev-wus3"
      + tags                = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + tenant_id           = (known after apply)
    }

  # module.keyvault.azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "westus3"
      + name                            = "kv-platform-dev-wus3"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = false
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "rg-aks-platform-dev-wus3"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tags                            = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + tenant_id                       = "63d0f08e-6579-4d52-9c95-4baef66906ea"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.keyvault.azurerm_role_assignment.admin_secrets_officer will be created
  + resource "azurerm_role_assignment" "admin_secrets_officer" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0cc8f21-14c5-4593-bba2-0b86e2fe05bb"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.monitoring.azurerm_log_analytics_solution.container_insights will be created
  + resource "azurerm_log_analytics_solution" "container_insights" {
      + id                    = (known after apply)
      + location              = "westus3"
      + resource_group_name   = "rg-aks-platform-dev-wus3"
      + solution_name         = "ContainerInsights"
      + tags                  = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + workspace_name        = "log-platform-dev-wus3"
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.monitoring.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "westus3"
      + name                            = "log-platform-dev-wus3"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-aks-platform-dev-wus3"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + workspace_id                    = (known after apply)
    }

  # module.monitoring.azurerm_monitor_workspace.main will be created
  + resource "azurerm_monitor_workspace" "main" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "westus3"
      + name                                = "amw-platform-dev-wus3"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "rg-aks-platform-dev-wus3"
      + tags                                = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
    }

  # module.networking.azurerm_network_security_group.aks will be created
  + resource "azurerm_network_security_group" "aks" {
      + id                  = (known after apply)
      + location            = "westus3"
      + name                = "nsg-platform-dev-wus3"
      + resource_group_name = "rg-aks-platform-dev-wus3"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "10.0.0.0/22"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHTTPS"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "10.0.0.0/22"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHTTP"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
    }

  # module.networking.azurerm_private_dns_zone.acr will be created
  + resource "azurerm_private_dns_zone" "acr" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-aks-platform-dev-wus3"
      + tags                                                  = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
    }

  # module.networking.azurerm_private_dns_zone.keyvault will be created
  + resource "azurerm_private_dns_zone" "keyvault" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-aks-platform-dev-wus3"
      + tags                                                  = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.acr will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "acr" {
      + id                    = (known after apply)
      + name                  = "acr-dns-link"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-aks-platform-dev-wus3"
      + tags                  = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.keyvault will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "keyvault" {
      + id                    = (known after apply)
      + name                  = "keyvault-dns-link"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-aks-platform-dev-wus3"
      + tags                  = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westus3"
      + name     = "rg-aks-platform-dev-wus3"
      + tags     = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
    }

  # module.networking.azurerm_subnet.aks_nodes will be created
  + resource "azurerm_subnet" "aks_nodes" {
      + address_prefixes                              = [
          + "10.0.0.0/22",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-aks-dev-wus3"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-aks-platform-dev-wus3"
      + service_endpoints                             = [
          + "Microsoft.ContainerRegistry",
          + "Microsoft.KeyVault",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "vnet-platform-dev-wus3"
    }

  # module.networking.azurerm_subnet.private_endpoints will be created
  + resource "azurerm_subnet" "private_endpoints" {
      + address_prefixes                              = [
          + "10.0.4.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-pe-dev-wus3"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-aks-platform-dev-wus3"
      + virtual_network_name                          = "vnet-platform-dev-wus3"
    }

  # module.networking.azurerm_subnet_network_security_group_association.aks will be created
  + resource "azurerm_subnet_network_security_group_association" "aks" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.networking.azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westus3"
      + name                           = "vnet-platform-dev-wus3"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-aks-platform-dev-wus3"
      + subnet                         = (known after apply)
      + tags                           = {
          + "Application" = "aks-platform"
          + "CostCenter"  = "IT-1234"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_id                      = (known after apply)
  + acr_login_command           = "az acr login --name acrplatformdevwus3"
  + acr_login_server            = (known after apply)
  + acr_name                    = "acrplatformdevwus3"
  + aks_cluster_fqdn            = (known after apply)
  + aks_cluster_id              = (known after apply)
  + aks_cluster_name            = "aks-platform-dev-wus3"
  + aks_oidc_issuer_url         = (known after apply)
  + aks_subnet_id               = (known after apply)
  + get_credentials_command     = "az aks get-credentials --resource-group rg-aks-platform-dev-wus3 --name aks-platform-dev-wus3"
  + keyvault_id                 = (known after apply)
  + keyvault_name               = "kv-platform-dev-wus3"
  + keyvault_uri                = (known after apply)
  + kubelet_identity_client_id  = (known after apply)
  + log_analytics_workspace_id  = (known after apply)
  + monitor_workspace_id        = (known after apply)
  + pe_subnet_id                = (known after apply)
  + resource_group_location     = "westus3"
  + resource_group_name         = "rg-aks-platform-dev-wus3"
  + vnet_id                     = (known after apply)
  + vnet_name                   = "vnet-platform-dev-wus3"
  + workload_identity_client_id = (known after apply)

Warning: Argument is deprecated

  with module.keyvault.azurerm_key_vault.main,
  on ../../modules/keyvault/main.tf line 24, in resource "azurerm_key_vault" "main":
  24:   enable_rbac_authorization       = true

This property has been renamed to `rbac_authorization_enabled` and will be
removed in v5.0 of the provider

(and one more similar warning elsewhere)

Error: Invalid count argument

  on ../../modules/keyvault/main.tf line 68, in resource "azurerm_role_assignment" "workload_secrets_user":
  68:   count = var.workload_identity_principal_id != "" ? 1 : 0

The "count" value depends on resource attributes that cannot be determined
until apply, so Terraform cannot predict how many instances will be created.
To work around this, use the -target argument to first apply only the
resources that the count depends on.

Error: invalid value for name (The name length must be from 2 to 23 characters. The name can only contain letters, numbers and dashes, and it must begin with a letter and end with a letter or digit.)

  with module.monitoring.azurerm_dashboard_grafana.main[0],
  on ../../modules/monitoring/main.tf line 52, in resource "azurerm_dashboard_grafana" "main":
  52:   name                              = var.grafana_name

::error::Terraform exited with code 1.

```

</details>

*Pushed by: @busadave13, Action: `pull_request`*